
INSERT INTO `report_type` (`id`, `report_type_content`, `parent_report_type_id`, `require_details`, `sub_report_type`, `common`) VALUES
	(1, '垃圾广告信息', 0, 1, 0, 0),
	(2, '不友善行为', 0, 0, 1, 0),
	(3, '有害信息', 0, 0, 1, 0),
	(4, '涉嫌侵权', 0, 0, 1, 0),
	(5, '诱导投票', 0, 1, 0, 0),
	(6, '其他', 0, 1, 0, 0),
	(7, '骚扰、辱骂、歧视等', 2, 0, 0, 0),
	(8, '其他不友善行为', 2, 1, 0, 0),
	(9, '政治敏感', 3, 0, 0, 0),
	(10, '色情低俗', 3, 0, 0, 0),
	(11, '不实信息', 3, 1, 0, 0),
	(12, '有人意图自杀或自残', 3, 0, 0, 0),
	(13, '违法违规', 3, 1, 0, 0),
	(14, '看相、算命、星盘等迷信活动', 3, 0, 0, 0),
	(15, '不规范转载', 4, 1, 0, 0),
	(16, '个人侵权', 4, 1, 0, 0),
	(17, '企业侵权', 4, 1, 0, 0);